In [24]:
#Loaded Titanic dataset using Pandas
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('titanic.csv')

In [6]:
#Checked structure and missing values using .info() and .isnull()

df.head()
df.info()
df.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

(418, 12)

In [31]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Embarked       0
Age_Group      0
Family_Size    0
dtype: int64

In [28]:
#Filled missing numeric values (Age) with median and categorical (Embarked) with mode
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [14]:
#Removed duplicate records to prevent double counting
df.duplicated().sum()
df = df.drop_duplicates()

In [16]:
#Cleaned text columns 'Name' and 'Ticket' by stripping spaces
df['Name'] = df['Name'].str.strip()
df['Ticket'] = df['Ticket'].str.strip()

In [18]:
 #Converted 'Survived' and 'Pclass' to integer for calculations
df['Survived'] = df['Survived'].astype(int)
df['Pclass'] = df['Pclass'].astype(int)

In [20]:
#Created new analytical features 'Age_Group' and 'Family_Size'
df['Age_Group'] = np.where(df['Age'] < 18, 'Child', 'Adult')

df['Family_Size'] = df['SibSp'] + df['Parch'] + 1

In [22]:
#Validated dataset to ensure no nulls remain
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Embarked     418 non-null    object
 11  Age_Group    418 non-null    object
 12  Family_Size  418 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 42.6+ KB

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Embarked       0
Age_Group      0
Family_Size    0
dtype: int64

In [23]:
#Saved cleaned dataset as 'cleaned_data.csv'
df.to_csv('cleaned_data.csv', index=False)